{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "3-1 dplyr.R",
      "provenance": [],
      "collapsed_sections": [],
      "authorship_tag": "ABX9TyN1pBWOMmxDTIJKIe8/0HUW",
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "ir",
      "display_name": "R"
    },
    "language_info": {
      "name": "R"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/BrewTC/R_business_analysis/blob/main/3-1%20dplyr.R\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "knvpCFi2Jkhp",
        "outputId": "2fa55d8e-ba5b-4399-fa18-65e9283a0b19"
      },
      "source": [
        "#tidyverse裡面就有包含dplyr\n",
        "library(tidyverse)"
      ],
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Warning message in system(\"timedatectl\", intern = TRUE):\n",
            "“running command 'timedatectl' had status 1”\n",
            "── \u001b[1mAttaching packages\u001b[22m ─────────────────────────────────────── tidyverse 1.3.0 ──\n",
            "\n",
            "\u001b[32m✔\u001b[39m \u001b[34mggplot2\u001b[39m 3.3.3     \u001b[32m✔\u001b[39m \u001b[34mpurrr  \u001b[39m 0.3.4\n",
            "\u001b[32m✔\u001b[39m \u001b[34mtibble \u001b[39m 3.1.0     \u001b[32m✔\u001b[39m \u001b[34mdplyr  \u001b[39m 1.0.5\n",
            "\u001b[32m✔\u001b[39m \u001b[34mtidyr  \u001b[39m 1.1.3     \u001b[32m✔\u001b[39m \u001b[34mstringr\u001b[39m 1.4.0\n",
            "\u001b[32m✔\u001b[39m \u001b[34mreadr  \u001b[39m 1.4.0     \u001b[32m✔\u001b[39m \u001b[34mforcats\u001b[39m 0.5.1\n",
            "\n",
            "── \u001b[1mConflicts\u001b[22m ────────────────────────────────────────── tidyverse_conflicts() ──\n",
            "\u001b[31m✖\u001b[39m \u001b[34mdplyr\u001b[39m::\u001b[32mfilter()\u001b[39m masks \u001b[34mstats\u001b[39m::filter()\n",
            "\u001b[31m✖\u001b[39m \u001b[34mdplyr\u001b[39m::\u001b[32mlag()\u001b[39m    masks \u001b[34mstats\u001b[39m::lag()\n",
            "\n"
          ],
          "name": "stderr"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "UthAifqrJzPt"
      },
      "source": [
        "library(dplyr)"
      ],
      "execution_count": 3,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "3rMTFuXWJz1T",
        "outputId": "f9606fd6-9c42-40ae-e3e5-c98a35be1d5f"
      },
      "source": [
        "# 資料篩選與排序\n",
        "# dplyr 套件提供了兩個方便進行資料篩選的函數：\n",
        "# Row 的篩選：filter 函數\n",
        "# Column 的篩選：select 函數\n",
        "mtcars.tb <- as_tibble(mtcars)\n",
        "print(mtcars.tb)"
      ],
      "execution_count": 5,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "\u001b[90m# A tibble: 32 x 11\u001b[39m\n",
            "     mpg   cyl  disp    hp  drat    wt  qsec    vs    am  gear  carb\n",
            "   \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m \u001b[3m\u001b[90m<dbl>\u001b[39m\u001b[23m\n",
            "\u001b[90m 1\u001b[39m  21       6  160    110  3.9   2.62  16.5     0     1     4     4\n",
            "\u001b[90m 2\u001b[39m  21       6  160    110  3.9   2.88  17.0     0     1     4     4\n",
            "\u001b[90m 3\u001b[39m  22.8     4  108     93  3.85  2.32  18.6     1     1     4     1\n",
            "\u001b[90m 4\u001b[39m  21.4     6  258    110  3.08  3.22  19.4     1     0     3     1\n",
            "\u001b[90m 5\u001b[39m  18.7     8  360    175  3.15  3.44  17.0     0     0     3     2\n",
            "\u001b[90m 6\u001b[39m  18.1     6  225    105  2.76  3.46  20.2     1     0     3     1\n",
            "\u001b[90m 7\u001b[39m  14.3     8  360    245  3.21  3.57  15.8     0     0     3     4\n",
            "\u001b[90m 8\u001b[39m  24.4     4  147.    62  3.69  3.19  20       1     0     4     2\n",
            "\u001b[90m 9\u001b[39m  22.8     4  141.    95  3.92  3.15  22.9     1     0     4     2\n",
            "\u001b[90m10\u001b[39m  19.2     6  168.   123  3.92  3.44  18.3     1     0     4     4\n",
            "\u001b[90m# … with 22 more rows\u001b[39m\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 245
        },
        "id": "ZjHhPSDRKiGm",
        "outputId": "1e6b57dc-e90c-4ad0-f3a4-8374c5982500"
      },
      "source": [
        "# 利用 filter 函數篩選出需要的 row\n",
        "# 想要篩選出一加侖汽油的可以跑超過 20 km 且馬力超過 100 匹馬力(hp)的汽車，可以使用 filter 函數：\n",
        "mtcars.tb %>%\n",
        "  filter(mpg > 20, hp > 100)"
      ],
      "execution_count": 6,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "  mpg  cyl disp  hp  drat wt    qsec  vs am gear carb\n",
              "1 21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4   \n",
              "2 21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4   \n",
              "3 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1   \n",
              "4 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2   \n",
              "5 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2   "
            ],
            "text/latex": "A tibble: 5 × 11\n\\begin{tabular}{lllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4\\\\\n\t 21.4 & 6 & 258.0 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 5 × 11\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |\n| 21.4 | 6 | 258.0 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 5 × 11</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.4</td><td>6</td><td>258.0</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "fHZBzsyUKx-L",
        "outputId": "d0b55314-0636-49e2-b287-8325fbe5e0fa"
      },
      "source": [
        "# 利用 select 函數篩選出需要的 column\n",
        "# 如果我們只需要看「一加侖汽油可跑距離」、「馬力」、與「前進檔數」三個變數，可以使用 select 函數：\n",
        "mtcars.tb %>%\n",
        "  select(mpg, hp, gear)"
      ],
      "execution_count": 7,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  hp  gear\n",
              "1  21.0 110 4   \n",
              "2  21.0 110 4   \n",
              "3  22.8  93 4   \n",
              "4  21.4 110 3   \n",
              "5  18.7 175 3   \n",
              "6  18.1 105 3   \n",
              "7  14.3 245 3   \n",
              "8  24.4  62 4   \n",
              "9  22.8  95 4   \n",
              "10 19.2 123 4   \n",
              "11 17.8 123 4   \n",
              "12 16.4 180 3   \n",
              "13 17.3 180 3   \n",
              "14 15.2 180 3   \n",
              "15 10.4 205 3   \n",
              "16 10.4 215 3   \n",
              "17 14.7 230 3   \n",
              "18 32.4  66 4   \n",
              "19 30.4  52 4   \n",
              "20 33.9  65 4   \n",
              "21 21.5  97 3   \n",
              "22 15.5 150 3   \n",
              "23 15.2 150 3   \n",
              "24 13.3 245 3   \n",
              "25 19.2 175 3   \n",
              "26 27.3  66 4   \n",
              "27 26.0  91 5   \n",
              "28 30.4 113 5   \n",
              "29 15.8 264 5   \n",
              "30 19.7 175 5   \n",
              "31 15.0 335 5   \n",
              "32 21.4 109 4   "
            ],
            "text/latex": "A tibble: 32 × 3\n\\begin{tabular}{lll}\n mpg & hp & gear\\\\\n <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 21.0 & 110 & 4\\\\\n\t 21.0 & 110 & 4\\\\\n\t 22.8 &  93 & 4\\\\\n\t 21.4 & 110 & 3\\\\\n\t 18.7 & 175 & 3\\\\\n\t 18.1 & 105 & 3\\\\\n\t 14.3 & 245 & 3\\\\\n\t 24.4 &  62 & 4\\\\\n\t 22.8 &  95 & 4\\\\\n\t 19.2 & 123 & 4\\\\\n\t 17.8 & 123 & 4\\\\\n\t 16.4 & 180 & 3\\\\\n\t 17.3 & 180 & 3\\\\\n\t 15.2 & 180 & 3\\\\\n\t 10.4 & 205 & 3\\\\\n\t 10.4 & 215 & 3\\\\\n\t 14.7 & 230 & 3\\\\\n\t 32.4 &  66 & 4\\\\\n\t 30.4 &  52 & 4\\\\\n\t 33.9 &  65 & 4\\\\\n\t 21.5 &  97 & 3\\\\\n\t 15.5 & 150 & 3\\\\\n\t 15.2 & 150 & 3\\\\\n\t 13.3 & 245 & 3\\\\\n\t 19.2 & 175 & 3\\\\\n\t 27.3 &  66 & 4\\\\\n\t 26.0 &  91 & 5\\\\\n\t 30.4 & 113 & 5\\\\\n\t 15.8 & 264 & 5\\\\\n\t 19.7 & 175 & 5\\\\\n\t 15.0 & 335 & 5\\\\\n\t 21.4 & 109 & 4\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 3\n\n| mpg &lt;dbl&gt; | hp &lt;dbl&gt; | gear &lt;dbl&gt; |\n|---|---|---|\n| 21.0 | 110 | 4 |\n| 21.0 | 110 | 4 |\n| 22.8 |  93 | 4 |\n| 21.4 | 110 | 3 |\n| 18.7 | 175 | 3 |\n| 18.1 | 105 | 3 |\n| 14.3 | 245 | 3 |\n| 24.4 |  62 | 4 |\n| 22.8 |  95 | 4 |\n| 19.2 | 123 | 4 |\n| 17.8 | 123 | 4 |\n| 16.4 | 180 | 3 |\n| 17.3 | 180 | 3 |\n| 15.2 | 180 | 3 |\n| 10.4 | 205 | 3 |\n| 10.4 | 215 | 3 |\n| 14.7 | 230 | 3 |\n| 32.4 |  66 | 4 |\n| 30.4 |  52 | 4 |\n| 33.9 |  65 | 4 |\n| 21.5 |  97 | 3 |\n| 15.5 | 150 | 3 |\n| 15.2 | 150 | 3 |\n| 13.3 | 245 | 3 |\n| 19.2 | 175 | 3 |\n| 27.3 |  66 | 4 |\n| 26.0 |  91 | 5 |\n| 30.4 | 113 | 5 |\n| 15.8 | 264 | 5 |\n| 19.7 | 175 | 5 |\n| 15.0 | 335 | 5 |\n| 21.4 | 109 | 4 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 3</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>hp</th><th scope=col>gear</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>21.0</td><td>110</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>110</td><td>4</td></tr>\n",
              "\t<tr><td>22.8</td><td> 93</td><td>4</td></tr>\n",
              "\t<tr><td>21.4</td><td>110</td><td>3</td></tr>\n",
              "\t<tr><td>18.7</td><td>175</td><td>3</td></tr>\n",
              "\t<tr><td>18.1</td><td>105</td><td>3</td></tr>\n",
              "\t<tr><td>14.3</td><td>245</td><td>3</td></tr>\n",
              "\t<tr><td>24.4</td><td> 62</td><td>4</td></tr>\n",
              "\t<tr><td>22.8</td><td> 95</td><td>4</td></tr>\n",
              "\t<tr><td>19.2</td><td>123</td><td>4</td></tr>\n",
              "\t<tr><td>17.8</td><td>123</td><td>4</td></tr>\n",
              "\t<tr><td>16.4</td><td>180</td><td>3</td></tr>\n",
              "\t<tr><td>17.3</td><td>180</td><td>3</td></tr>\n",
              "\t<tr><td>15.2</td><td>180</td><td>3</td></tr>\n",
              "\t<tr><td>10.4</td><td>205</td><td>3</td></tr>\n",
              "\t<tr><td>10.4</td><td>215</td><td>3</td></tr>\n",
              "\t<tr><td>14.7</td><td>230</td><td>3</td></tr>\n",
              "\t<tr><td>32.4</td><td> 66</td><td>4</td></tr>\n",
              "\t<tr><td>30.4</td><td> 52</td><td>4</td></tr>\n",
              "\t<tr><td>33.9</td><td> 65</td><td>4</td></tr>\n",
              "\t<tr><td>21.5</td><td> 97</td><td>3</td></tr>\n",
              "\t<tr><td>15.5</td><td>150</td><td>3</td></tr>\n",
              "\t<tr><td>15.2</td><td>150</td><td>3</td></tr>\n",
              "\t<tr><td>13.3</td><td>245</td><td>3</td></tr>\n",
              "\t<tr><td>19.2</td><td>175</td><td>3</td></tr>\n",
              "\t<tr><td>27.3</td><td> 66</td><td>4</td></tr>\n",
              "\t<tr><td>26.0</td><td> 91</td><td>5</td></tr>\n",
              "\t<tr><td>30.4</td><td>113</td><td>5</td></tr>\n",
              "\t<tr><td>15.8</td><td>264</td><td>5</td></tr>\n",
              "\t<tr><td>19.7</td><td>175</td><td>5</td></tr>\n",
              "\t<tr><td>15.0</td><td>335</td><td>5</td></tr>\n",
              "\t<tr><td>21.4</td><td>109</td><td>4</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 262
        },
        "id": "bKHJ9LSkK-bt",
        "outputId": "d582294e-7296-4f2d-e4d2-5859c0a7a8f1"
      },
      "source": [
        "# 我們可以篩選出一加侖汽油的可以跑超過 20 km 且馬力超過 100 匹馬力汽車的「前進檔數」：\n",
        "mtcars.tb %>%\n",
        "  filter(\n",
        "    mpg > 20,\n",
        "    hp > 100) %>%\n",
        "  select(gear)"
      ],
      "execution_count": 8,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "  gear\n",
              "1 4   \n",
              "2 4   \n",
              "3 3   \n",
              "4 5   \n",
              "5 4   "
            ],
            "text/latex": "A tibble: 5 × 1\n\\begin{tabular}{l}\n gear\\\\\n <dbl>\\\\\n\\hline\n\t 4\\\\\n\t 4\\\\\n\t 3\\\\\n\t 5\\\\\n\t 4\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 5 × 1\n\n| gear &lt;dbl&gt; |\n|---|\n| 4 |\n| 4 |\n| 3 |\n| 5 |\n| 4 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 5 × 1</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>gear</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>4</td></tr>\n",
              "\t<tr><td>4</td></tr>\n",
              "\t<tr><td>3</td></tr>\n",
              "\t<tr><td>5</td></tr>\n",
              "\t<tr><td>4</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "VbZliXSTLFdz",
        "outputId": "ec90f083-9da7-45ff-c799-5c7e4884e345"
      },
      "source": [
        "# 利用 arrange 函數進行資料排序(預設為升冪排列)\n",
        "# 假設我們想要根據某一個 columns 將資料集合的 rows 做排序，可以使用 arrange 函數，同時也可以按照多個 columns 的順序進行排序，會按照 columns 的先後順序進行排序。原始設定是升冪排列，如果想要改成降冪排列的話可以使用 desc(column_name) 指令。\n",
        "\n",
        "mtcars.tb %>%\n",
        "  arrange(\n",
        "    cyl,\n",
        "    disp\n",
        "  )"
      ],
      "execution_count": 9,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb\n",
              "1  33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1   \n",
              "2  30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2   \n",
              "3  32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1   \n",
              "4  27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1   \n",
              "5  30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2   \n",
              "6  22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1   \n",
              "7  21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1   \n",
              "8  26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2   \n",
              "9  21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2   \n",
              "10 22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2   \n",
              "11 24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2   \n",
              "12 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6   \n",
              "13 21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4   \n",
              "14 21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4   \n",
              "15 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4   \n",
              "16 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4   \n",
              "17 18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1   \n",
              "18 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1   \n",
              "19 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3   \n",
              "20 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3   \n",
              "21 15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3   \n",
              "22 15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8   \n",
              "23 15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2   \n",
              "24 15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2   \n",
              "25 13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4   \n",
              "26 15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4   \n",
              "27 18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2   \n",
              "28 14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4   \n",
              "29 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2   \n",
              "30 14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4   \n",
              "31 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4   \n",
              "32 10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4   "
            ],
            "text/latex": "A tibble: 32 × 11\n\\begin{tabular}{lllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 33.9 & 4 &  71.1 &  65 & 4.22 & 1.835 & 19.90 & 1 & 1 & 4 & 1\\\\\n\t 30.4 & 4 &  75.7 &  52 & 4.93 & 1.615 & 18.52 & 1 & 1 & 4 & 2\\\\\n\t 32.4 & 4 &  78.7 &  66 & 4.08 & 2.200 & 19.47 & 1 & 1 & 4 & 1\\\\\n\t 27.3 & 4 &  79.0 &  66 & 4.08 & 1.935 & 18.90 & 1 & 1 & 4 & 1\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 22.8 & 4 & 108.0 &  93 & 3.85 & 2.320 & 18.61 & 1 & 1 & 4 & 1\\\\\n\t 21.5 & 4 & 120.1 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1\\\\\n\t 26.0 & 4 & 120.3 &  91 & 4.43 & 2.140 & 16.70 & 0 & 1 & 5 & 2\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\t 22.8 & 4 & 140.8 &  95 & 3.92 & 3.150 & 22.90 & 1 & 0 & 4 & 2\\\\\n\t 24.4 & 4 & 146.7 &  62 & 3.69 & 3.190 & 20.00 & 1 & 0 & 4 & 2\\\\\n\t 19.7 & 6 & 145.0 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4\\\\\n\t 19.2 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4\\\\\n\t 17.8 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4\\\\\n\t 18.1 & 6 & 225.0 & 105 & 2.76 & 3.460 & 20.22 & 1 & 0 & 3 & 1\\\\\n\t 21.4 & 6 & 258.0 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1\\\\\n\t 16.4 & 8 & 275.8 & 180 & 3.07 & 4.070 & 17.40 & 0 & 0 & 3 & 3\\\\\n\t 17.3 & 8 & 275.8 & 180 & 3.07 & 3.730 & 17.60 & 0 & 0 & 3 & 3\\\\\n\t 15.2 & 8 & 275.8 & 180 & 3.07 & 3.780 & 18.00 & 0 & 0 & 3 & 3\\\\\n\t 15.0 & 8 & 301.0 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8\\\\\n\t 15.2 & 8 & 304.0 & 150 & 3.15 & 3.435 & 17.30 & 0 & 0 & 3 & 2\\\\\n\t 15.5 & 8 & 318.0 & 150 & 2.76 & 3.520 & 16.87 & 0 & 0 & 3 & 2\\\\\n\t 13.3 & 8 & 350.0 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4\\\\\n\t 15.8 & 8 & 351.0 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4\\\\\n\t 18.7 & 8 & 360.0 & 175 & 3.15 & 3.440 & 17.02 & 0 & 0 & 3 & 2\\\\\n\t 14.3 & 8 & 360.0 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4\\\\\n\t 19.2 & 8 & 400.0 & 175 & 3.08 & 3.845 & 17.05 & 0 & 0 & 3 & 2\\\\\n\t 14.7 & 8 & 440.0 & 230 & 3.23 & 5.345 & 17.42 & 0 & 0 & 3 & 4\\\\\n\t 10.4 & 8 & 460.0 & 215 & 3.00 & 5.424 & 17.82 & 0 & 0 & 3 & 4\\\\\n\t 10.4 & 8 & 472.0 & 205 & 2.93 & 5.250 & 17.98 & 0 & 0 & 3 & 4\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 11\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|\n| 33.9 | 4 |  71.1 |  65 | 4.22 | 1.835 | 19.90 | 1 | 1 | 4 | 1 |\n| 30.4 | 4 |  75.7 |  52 | 4.93 | 1.615 | 18.52 | 1 | 1 | 4 | 2 |\n| 32.4 | 4 |  78.7 |  66 | 4.08 | 2.200 | 19.47 | 1 | 1 | 4 | 1 |\n| 27.3 | 4 |  79.0 |  66 | 4.08 | 1.935 | 18.90 | 1 | 1 | 4 | 1 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 22.8 | 4 | 108.0 |  93 | 3.85 | 2.320 | 18.61 | 1 | 1 | 4 | 1 |\n| 21.5 | 4 | 120.1 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |\n| 26.0 | 4 | 120.3 |  91 | 4.43 | 2.140 | 16.70 | 0 | 1 | 5 | 2 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n| 22.8 | 4 | 140.8 |  95 | 3.92 | 3.150 | 22.90 | 1 | 0 | 4 | 2 |\n| 24.4 | 4 | 146.7 |  62 | 3.69 | 3.190 | 20.00 | 1 | 0 | 4 | 2 |\n| 19.7 | 6 | 145.0 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |\n| 19.2 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 |\n| 17.8 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 |\n| 18.1 | 6 | 225.0 | 105 | 2.76 | 3.460 | 20.22 | 1 | 0 | 3 | 1 |\n| 21.4 | 6 | 258.0 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |\n| 16.4 | 8 | 275.8 | 180 | 3.07 | 4.070 | 17.40 | 0 | 0 | 3 | 3 |\n| 17.3 | 8 | 275.8 | 180 | 3.07 | 3.730 | 17.60 | 0 | 0 | 3 | 3 |\n| 15.2 | 8 | 275.8 | 180 | 3.07 | 3.780 | 18.00 | 0 | 0 | 3 | 3 |\n| 15.0 | 8 | 301.0 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 |\n| 15.2 | 8 | 304.0 | 150 | 3.15 | 3.435 | 17.30 | 0 | 0 | 3 | 2 |\n| 15.5 | 8 | 318.0 | 150 | 2.76 | 3.520 | 16.87 | 0 | 0 | 3 | 2 |\n| 13.3 | 8 | 350.0 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 |\n| 15.8 | 8 | 351.0 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 |\n| 18.7 | 8 | 360.0 | 175 | 3.15 | 3.440 | 17.02 | 0 | 0 | 3 | 2 |\n| 14.3 | 8 | 360.0 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 |\n| 19.2 | 8 | 400.0 | 175 | 3.08 | 3.845 | 17.05 | 0 | 0 | 3 | 2 |\n| 14.7 | 8 | 440.0 | 230 | 3.23 | 5.345 | 17.42 | 0 | 0 | 3 | 4 |\n| 10.4 | 8 | 460.0 | 215 | 3.00 | 5.424 | 17.82 | 0 | 0 | 3 | 4 |\n| 10.4 | 8 | 472.0 | 205 | 2.93 | 5.250 | 17.98 | 0 | 0 | 3 | 4 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 11</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>33.9</td><td>4</td><td> 71.1</td><td> 65</td><td>4.22</td><td>1.835</td><td>19.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 75.7</td><td> 52</td><td>4.93</td><td>1.615</td><td>18.52</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>32.4</td><td>4</td><td> 78.7</td><td> 66</td><td>4.08</td><td>2.200</td><td>19.47</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>27.3</td><td>4</td><td> 79.0</td><td> 66</td><td>4.08</td><td>1.935</td><td>18.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>108.0</td><td> 93</td><td>3.85</td><td>2.320</td><td>18.61</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>21.5</td><td>4</td><td>120.1</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>26.0</td><td>4</td><td>120.3</td><td> 91</td><td>4.43</td><td>2.140</td><td>16.70</td><td>0</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>140.8</td><td> 95</td><td>3.92</td><td>3.150</td><td>22.90</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>24.4</td><td>4</td><td>146.7</td><td> 62</td><td>3.69</td><td>3.190</td><td>20.00</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>19.7</td><td>6</td><td>145.0</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>19.2</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>17.8</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>18.1</td><td>6</td><td>225.0</td><td>105</td><td>2.76</td><td>3.460</td><td>20.22</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>21.4</td><td>6</td><td>258.0</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>16.4</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>4.070</td><td>17.40</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>17.3</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.730</td><td>17.60</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.780</td><td>18.00</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>15.0</td><td>8</td><td>301.0</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>304.0</td><td>150</td><td>3.15</td><td>3.435</td><td>17.30</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>15.5</td><td>8</td><td>318.0</td><td>150</td><td>2.76</td><td>3.520</td><td>16.87</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>13.3</td><td>8</td><td>350.0</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>15.8</td><td>8</td><td>351.0</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td></tr>\n",
              "\t<tr><td>18.7</td><td>8</td><td>360.0</td><td>175</td><td>3.15</td><td>3.440</td><td>17.02</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>14.3</td><td>8</td><td>360.0</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>19.2</td><td>8</td><td>400.0</td><td>175</td><td>3.08</td><td>3.845</td><td>17.05</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>14.7</td><td>8</td><td>440.0</td><td>230</td><td>3.23</td><td>5.345</td><td>17.42</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>460.0</td><td>215</td><td>3.00</td><td>5.424</td><td>17.82</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>472.0</td><td>205</td><td>2.93</td><td>5.250</td><td>17.98</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "oZqNiJ8fLhmE",
        "outputId": "da18ab49-dee7-4c21-938c-f820244c5840"
      },
      "source": [
        "# arrange(desc( ))為降冪排列\n",
        "mtcars.tb %>%\n",
        "  arrange(\n",
        "    desc(disp)\n",
        "  )"
      ],
      "execution_count": 10,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb\n",
              "1  10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4   \n",
              "2  10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4   \n",
              "3  14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4   \n",
              "4  19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2   \n",
              "5  18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2   \n",
              "6  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4   \n",
              "7  15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4   \n",
              "8  13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4   \n",
              "9  15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2   \n",
              "10 15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2   \n",
              "11 15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8   \n",
              "12 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3   \n",
              "13 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3   \n",
              "14 15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3   \n",
              "15 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1   \n",
              "16 18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1   \n",
              "17 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4   \n",
              "18 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4   \n",
              "19 21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4   \n",
              "20 21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4   \n",
              "21 24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2   \n",
              "22 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6   \n",
              "23 22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2   \n",
              "24 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2   \n",
              "25 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2   \n",
              "26 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1   \n",
              "27 22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1   \n",
              "28 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2   \n",
              "29 27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1   \n",
              "30 32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1   \n",
              "31 30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2   \n",
              "32 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1   "
            ],
            "text/latex": "A tibble: 32 × 11\n\\begin{tabular}{lllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 10.4 & 8 & 472.0 & 205 & 2.93 & 5.250 & 17.98 & 0 & 0 & 3 & 4\\\\\n\t 10.4 & 8 & 460.0 & 215 & 3.00 & 5.424 & 17.82 & 0 & 0 & 3 & 4\\\\\n\t 14.7 & 8 & 440.0 & 230 & 3.23 & 5.345 & 17.42 & 0 & 0 & 3 & 4\\\\\n\t 19.2 & 8 & 400.0 & 175 & 3.08 & 3.845 & 17.05 & 0 & 0 & 3 & 2\\\\\n\t 18.7 & 8 & 360.0 & 175 & 3.15 & 3.440 & 17.02 & 0 & 0 & 3 & 2\\\\\n\t 14.3 & 8 & 360.0 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4\\\\\n\t 15.8 & 8 & 351.0 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4\\\\\n\t 13.3 & 8 & 350.0 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4\\\\\n\t 15.5 & 8 & 318.0 & 150 & 2.76 & 3.520 & 16.87 & 0 & 0 & 3 & 2\\\\\n\t 15.2 & 8 & 304.0 & 150 & 3.15 & 3.435 & 17.30 & 0 & 0 & 3 & 2\\\\\n\t 15.0 & 8 & 301.0 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8\\\\\n\t 16.4 & 8 & 275.8 & 180 & 3.07 & 4.070 & 17.40 & 0 & 0 & 3 & 3\\\\\n\t 17.3 & 8 & 275.8 & 180 & 3.07 & 3.730 & 17.60 & 0 & 0 & 3 & 3\\\\\n\t 15.2 & 8 & 275.8 & 180 & 3.07 & 3.780 & 18.00 & 0 & 0 & 3 & 3\\\\\n\t 21.4 & 6 & 258.0 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1\\\\\n\t 18.1 & 6 & 225.0 & 105 & 2.76 & 3.460 & 20.22 & 1 & 0 & 3 & 1\\\\\n\t 19.2 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4\\\\\n\t 17.8 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4\\\\\n\t 24.4 & 4 & 146.7 &  62 & 3.69 & 3.190 & 20.00 & 1 & 0 & 4 & 2\\\\\n\t 19.7 & 6 & 145.0 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6\\\\\n\t 22.8 & 4 & 140.8 &  95 & 3.92 & 3.150 & 22.90 & 1 & 0 & 4 & 2\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\t 26.0 & 4 & 120.3 &  91 & 4.43 & 2.140 & 16.70 & 0 & 1 & 5 & 2\\\\\n\t 21.5 & 4 & 120.1 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1\\\\\n\t 22.8 & 4 & 108.0 &  93 & 3.85 & 2.320 & 18.61 & 1 & 1 & 4 & 1\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 27.3 & 4 &  79.0 &  66 & 4.08 & 1.935 & 18.90 & 1 & 1 & 4 & 1\\\\\n\t 32.4 & 4 &  78.7 &  66 & 4.08 & 2.200 & 19.47 & 1 & 1 & 4 & 1\\\\\n\t 30.4 & 4 &  75.7 &  52 & 4.93 & 1.615 & 18.52 & 1 & 1 & 4 & 2\\\\\n\t 33.9 & 4 &  71.1 &  65 & 4.22 & 1.835 & 19.90 & 1 & 1 & 4 & 1\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 11\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|\n| 10.4 | 8 | 472.0 | 205 | 2.93 | 5.250 | 17.98 | 0 | 0 | 3 | 4 |\n| 10.4 | 8 | 460.0 | 215 | 3.00 | 5.424 | 17.82 | 0 | 0 | 3 | 4 |\n| 14.7 | 8 | 440.0 | 230 | 3.23 | 5.345 | 17.42 | 0 | 0 | 3 | 4 |\n| 19.2 | 8 | 400.0 | 175 | 3.08 | 3.845 | 17.05 | 0 | 0 | 3 | 2 |\n| 18.7 | 8 | 360.0 | 175 | 3.15 | 3.440 | 17.02 | 0 | 0 | 3 | 2 |\n| 14.3 | 8 | 360.0 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 |\n| 15.8 | 8 | 351.0 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 |\n| 13.3 | 8 | 350.0 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 |\n| 15.5 | 8 | 318.0 | 150 | 2.76 | 3.520 | 16.87 | 0 | 0 | 3 | 2 |\n| 15.2 | 8 | 304.0 | 150 | 3.15 | 3.435 | 17.30 | 0 | 0 | 3 | 2 |\n| 15.0 | 8 | 301.0 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 |\n| 16.4 | 8 | 275.8 | 180 | 3.07 | 4.070 | 17.40 | 0 | 0 | 3 | 3 |\n| 17.3 | 8 | 275.8 | 180 | 3.07 | 3.730 | 17.60 | 0 | 0 | 3 | 3 |\n| 15.2 | 8 | 275.8 | 180 | 3.07 | 3.780 | 18.00 | 0 | 0 | 3 | 3 |\n| 21.4 | 6 | 258.0 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |\n| 18.1 | 6 | 225.0 | 105 | 2.76 | 3.460 | 20.22 | 1 | 0 | 3 | 1 |\n| 19.2 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 |\n| 17.8 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |\n| 24.4 | 4 | 146.7 |  62 | 3.69 | 3.190 | 20.00 | 1 | 0 | 4 | 2 |\n| 19.7 | 6 | 145.0 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 |\n| 22.8 | 4 | 140.8 |  95 | 3.92 | 3.150 | 22.90 | 1 | 0 | 4 | 2 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n| 26.0 | 4 | 120.3 |  91 | 4.43 | 2.140 | 16.70 | 0 | 1 | 5 | 2 |\n| 21.5 | 4 | 120.1 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |\n| 22.8 | 4 | 108.0 |  93 | 3.85 | 2.320 | 18.61 | 1 | 1 | 4 | 1 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 27.3 | 4 |  79.0 |  66 | 4.08 | 1.935 | 18.90 | 1 | 1 | 4 | 1 |\n| 32.4 | 4 |  78.7 |  66 | 4.08 | 2.200 | 19.47 | 1 | 1 | 4 | 1 |\n| 30.4 | 4 |  75.7 |  52 | 4.93 | 1.615 | 18.52 | 1 | 1 | 4 | 2 |\n| 33.9 | 4 |  71.1 |  65 | 4.22 | 1.835 | 19.90 | 1 | 1 | 4 | 1 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 11</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>10.4</td><td>8</td><td>472.0</td><td>205</td><td>2.93</td><td>5.250</td><td>17.98</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>460.0</td><td>215</td><td>3.00</td><td>5.424</td><td>17.82</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>14.7</td><td>8</td><td>440.0</td><td>230</td><td>3.23</td><td>5.345</td><td>17.42</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>19.2</td><td>8</td><td>400.0</td><td>175</td><td>3.08</td><td>3.845</td><td>17.05</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>18.7</td><td>8</td><td>360.0</td><td>175</td><td>3.15</td><td>3.440</td><td>17.02</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>14.3</td><td>8</td><td>360.0</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>15.8</td><td>8</td><td>351.0</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td></tr>\n",
              "\t<tr><td>13.3</td><td>8</td><td>350.0</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>15.5</td><td>8</td><td>318.0</td><td>150</td><td>2.76</td><td>3.520</td><td>16.87</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>304.0</td><td>150</td><td>3.15</td><td>3.435</td><td>17.30</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>15.0</td><td>8</td><td>301.0</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td></tr>\n",
              "\t<tr><td>16.4</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>4.070</td><td>17.40</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>17.3</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.730</td><td>17.60</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.780</td><td>18.00</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>21.4</td><td>6</td><td>258.0</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>18.1</td><td>6</td><td>225.0</td><td>105</td><td>2.76</td><td>3.460</td><td>20.22</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>19.2</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>17.8</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>24.4</td><td>4</td><td>146.7</td><td> 62</td><td>3.69</td><td>3.190</td><td>20.00</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>19.7</td><td>6</td><td>145.0</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>140.8</td><td> 95</td><td>3.92</td><td>3.150</td><td>22.90</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>26.0</td><td>4</td><td>120.3</td><td> 91</td><td>4.43</td><td>2.140</td><td>16.70</td><td>0</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>21.5</td><td>4</td><td>120.1</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>108.0</td><td> 93</td><td>3.85</td><td>2.320</td><td>18.61</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>27.3</td><td>4</td><td> 79.0</td><td> 66</td><td>4.08</td><td>1.935</td><td>18.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>32.4</td><td>4</td><td> 78.7</td><td> 66</td><td>4.08</td><td>2.200</td><td>19.47</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 75.7</td><td> 52</td><td>4.93</td><td>1.615</td><td>18.52</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>33.9</td><td>4</td><td> 71.1</td><td> 65</td><td>4.22</td><td>1.835</td><td>19.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "nE0bXtawL3f3",
        "outputId": "213d7ffe-4f20-49fa-dca8-78e5b8a4908f"
      },
      "source": [
        "# 使用 mutate 建立新的變數\n",
        "# 在 tidy 架構下，我們喜歡使用 mutate 函數，將原資料集合的變數做運算與得到新變數。\n",
        "# mutate 函數會將新的變數儲存在原資料集合的最後一個 column。\n",
        "mtcars.tb %>%\n",
        "  mutate(\n",
        "    cyl2 = cyl * 2,\n",
        "    cyl4 = cyl2 * 2\n",
        "  )"
      ],
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb cyl2 cyl4\n",
              "1  21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4    12   24  \n",
              "2  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4    12   24  \n",
              "3  22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1     8   16  \n",
              "4  21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1    12   24  \n",
              "5  18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2    16   32  \n",
              "6  18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1    12   24  \n",
              "7  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4    16   32  \n",
              "8  24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2     8   16  \n",
              "9  22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2     8   16  \n",
              "10 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4    12   24  \n",
              "11 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4    12   24  \n",
              "12 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3    16   32  \n",
              "13 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3    16   32  \n",
              "14 15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3    16   32  \n",
              "15 10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4    16   32  \n",
              "16 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4    16   32  \n",
              "17 14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4    16   32  \n",
              "18 32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1     8   16  \n",
              "19 30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2     8   16  \n",
              "20 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1     8   16  \n",
              "21 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1     8   16  \n",
              "22 15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2    16   32  \n",
              "23 15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2    16   32  \n",
              "24 13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4    16   32  \n",
              "25 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2    16   32  \n",
              "26 27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1     8   16  \n",
              "27 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2     8   16  \n",
              "28 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2     8   16  \n",
              "29 15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4    16   32  \n",
              "30 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6    12   24  \n",
              "31 15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8    16   32  \n",
              "32 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2     8   16  "
            ],
            "text/latex": "A tibble: 32 × 13\n\\begin{tabular}{lllllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb & cyl2 & cyl4\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4 & 12 & 24\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4 & 12 & 24\\\\\n\t 22.8 & 4 & 108.0 &  93 & 3.85 & 2.320 & 18.61 & 1 & 1 & 4 & 1 &  8 & 16\\\\\n\t 21.4 & 6 & 258.0 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1 & 12 & 24\\\\\n\t 18.7 & 8 & 360.0 & 175 & 3.15 & 3.440 & 17.02 & 0 & 0 & 3 & 2 & 16 & 32\\\\\n\t 18.1 & 6 & 225.0 & 105 & 2.76 & 3.460 & 20.22 & 1 & 0 & 3 & 1 & 12 & 24\\\\\n\t 14.3 & 8 & 360.0 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4 & 16 & 32\\\\\n\t 24.4 & 4 & 146.7 &  62 & 3.69 & 3.190 & 20.00 & 1 & 0 & 4 & 2 &  8 & 16\\\\\n\t 22.8 & 4 & 140.8 &  95 & 3.92 & 3.150 & 22.90 & 1 & 0 & 4 & 2 &  8 & 16\\\\\n\t 19.2 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4 & 12 & 24\\\\\n\t 17.8 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4 & 12 & 24\\\\\n\t 16.4 & 8 & 275.8 & 180 & 3.07 & 4.070 & 17.40 & 0 & 0 & 3 & 3 & 16 & 32\\\\\n\t 17.3 & 8 & 275.8 & 180 & 3.07 & 3.730 & 17.60 & 0 & 0 & 3 & 3 & 16 & 32\\\\\n\t 15.2 & 8 & 275.8 & 180 & 3.07 & 3.780 & 18.00 & 0 & 0 & 3 & 3 & 16 & 32\\\\\n\t 10.4 & 8 & 472.0 & 205 & 2.93 & 5.250 & 17.98 & 0 & 0 & 3 & 4 & 16 & 32\\\\\n\t 10.4 & 8 & 460.0 & 215 & 3.00 & 5.424 & 17.82 & 0 & 0 & 3 & 4 & 16 & 32\\\\\n\t 14.7 & 8 & 440.0 & 230 & 3.23 & 5.345 & 17.42 & 0 & 0 & 3 & 4 & 16 & 32\\\\\n\t 32.4 & 4 &  78.7 &  66 & 4.08 & 2.200 & 19.47 & 1 & 1 & 4 & 1 &  8 & 16\\\\\n\t 30.4 & 4 &  75.7 &  52 & 4.93 & 1.615 & 18.52 & 1 & 1 & 4 & 2 &  8 & 16\\\\\n\t 33.9 & 4 &  71.1 &  65 & 4.22 & 1.835 & 19.90 & 1 & 1 & 4 & 1 &  8 & 16\\\\\n\t 21.5 & 4 & 120.1 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1 &  8 & 16\\\\\n\t 15.5 & 8 & 318.0 & 150 & 2.76 & 3.520 & 16.87 & 0 & 0 & 3 & 2 & 16 & 32\\\\\n\t 15.2 & 8 & 304.0 & 150 & 3.15 & 3.435 & 17.30 & 0 & 0 & 3 & 2 & 16 & 32\\\\\n\t 13.3 & 8 & 350.0 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4 & 16 & 32\\\\\n\t 19.2 & 8 & 400.0 & 175 & 3.08 & 3.845 & 17.05 & 0 & 0 & 3 & 2 & 16 & 32\\\\\n\t 27.3 & 4 &  79.0 &  66 & 4.08 & 1.935 & 18.90 & 1 & 1 & 4 & 1 &  8 & 16\\\\\n\t 26.0 & 4 & 120.3 &  91 & 4.43 & 2.140 & 16.70 & 0 & 1 & 5 & 2 &  8 & 16\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2 &  8 & 16\\\\\n\t 15.8 & 8 & 351.0 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4 & 16 & 32\\\\\n\t 19.7 & 6 & 145.0 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6 & 12 & 24\\\\\n\t 15.0 & 8 & 301.0 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8 & 16 & 32\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2 &  8 & 16\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 13\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; | cyl2 &lt;dbl&gt; | cyl4 &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 | 12 | 24 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 | 12 | 24 |\n| 22.8 | 4 | 108.0 |  93 | 3.85 | 2.320 | 18.61 | 1 | 1 | 4 | 1 |  8 | 16 |\n| 21.4 | 6 | 258.0 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 | 12 | 24 |\n| 18.7 | 8 | 360.0 | 175 | 3.15 | 3.440 | 17.02 | 0 | 0 | 3 | 2 | 16 | 32 |\n| 18.1 | 6 | 225.0 | 105 | 2.76 | 3.460 | 20.22 | 1 | 0 | 3 | 1 | 12 | 24 |\n| 14.3 | 8 | 360.0 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 | 16 | 32 |\n| 24.4 | 4 | 146.7 |  62 | 3.69 | 3.190 | 20.00 | 1 | 0 | 4 | 2 |  8 | 16 |\n| 22.8 | 4 | 140.8 |  95 | 3.92 | 3.150 | 22.90 | 1 | 0 | 4 | 2 |  8 | 16 |\n| 19.2 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 | 12 | 24 |\n| 17.8 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 | 12 | 24 |\n| 16.4 | 8 | 275.8 | 180 | 3.07 | 4.070 | 17.40 | 0 | 0 | 3 | 3 | 16 | 32 |\n| 17.3 | 8 | 275.8 | 180 | 3.07 | 3.730 | 17.60 | 0 | 0 | 3 | 3 | 16 | 32 |\n| 15.2 | 8 | 275.8 | 180 | 3.07 | 3.780 | 18.00 | 0 | 0 | 3 | 3 | 16 | 32 |\n| 10.4 | 8 | 472.0 | 205 | 2.93 | 5.250 | 17.98 | 0 | 0 | 3 | 4 | 16 | 32 |\n| 10.4 | 8 | 460.0 | 215 | 3.00 | 5.424 | 17.82 | 0 | 0 | 3 | 4 | 16 | 32 |\n| 14.7 | 8 | 440.0 | 230 | 3.23 | 5.345 | 17.42 | 0 | 0 | 3 | 4 | 16 | 32 |\n| 32.4 | 4 |  78.7 |  66 | 4.08 | 2.200 | 19.47 | 1 | 1 | 4 | 1 |  8 | 16 |\n| 30.4 | 4 |  75.7 |  52 | 4.93 | 1.615 | 18.52 | 1 | 1 | 4 | 2 |  8 | 16 |\n| 33.9 | 4 |  71.1 |  65 | 4.22 | 1.835 | 19.90 | 1 | 1 | 4 | 1 |  8 | 16 |\n| 21.5 | 4 | 120.1 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |  8 | 16 |\n| 15.5 | 8 | 318.0 | 150 | 2.76 | 3.520 | 16.87 | 0 | 0 | 3 | 2 | 16 | 32 |\n| 15.2 | 8 | 304.0 | 150 | 3.15 | 3.435 | 17.30 | 0 | 0 | 3 | 2 | 16 | 32 |\n| 13.3 | 8 | 350.0 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 | 16 | 32 |\n| 19.2 | 8 | 400.0 | 175 | 3.08 | 3.845 | 17.05 | 0 | 0 | 3 | 2 | 16 | 32 |\n| 27.3 | 4 |  79.0 |  66 | 4.08 | 1.935 | 18.90 | 1 | 1 | 4 | 1 |  8 | 16 |\n| 26.0 | 4 | 120.3 |  91 | 4.43 | 2.140 | 16.70 | 0 | 1 | 5 | 2 |  8 | 16 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |  8 | 16 |\n| 15.8 | 8 | 351.0 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 | 16 | 32 |\n| 19.7 | 6 | 145.0 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 | 12 | 24 |\n| 15.0 | 8 | 301.0 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 | 16 | 32 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |  8 | 16 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 13</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th><th scope=col>cyl2</th><th scope=col>cyl4</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>108.0</td><td> 93</td><td>3.85</td><td>2.320</td><td>18.61</td><td>1</td><td>1</td><td>4</td><td>1</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>21.4</td><td>6</td><td>258.0</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>18.7</td><td>8</td><td>360.0</td><td>175</td><td>3.15</td><td>3.440</td><td>17.02</td><td>0</td><td>0</td><td>3</td><td>2</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>18.1</td><td>6</td><td>225.0</td><td>105</td><td>2.76</td><td>3.460</td><td>20.22</td><td>1</td><td>0</td><td>3</td><td>1</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>14.3</td><td>8</td><td>360.0</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>24.4</td><td>4</td><td>146.7</td><td> 62</td><td>3.69</td><td>3.190</td><td>20.00</td><td>1</td><td>0</td><td>4</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>140.8</td><td> 95</td><td>3.92</td><td>3.150</td><td>22.90</td><td>1</td><td>0</td><td>4</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>19.2</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>17.8</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>16.4</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>4.070</td><td>17.40</td><td>0</td><td>0</td><td>3</td><td>3</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>17.3</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.730</td><td>17.60</td><td>0</td><td>0</td><td>3</td><td>3</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.780</td><td>18.00</td><td>0</td><td>0</td><td>3</td><td>3</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>472.0</td><td>205</td><td>2.93</td><td>5.250</td><td>17.98</td><td>0</td><td>0</td><td>3</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>460.0</td><td>215</td><td>3.00</td><td>5.424</td><td>17.82</td><td>0</td><td>0</td><td>3</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>14.7</td><td>8</td><td>440.0</td><td>230</td><td>3.23</td><td>5.345</td><td>17.42</td><td>0</td><td>0</td><td>3</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>32.4</td><td>4</td><td> 78.7</td><td> 66</td><td>4.08</td><td>2.200</td><td>19.47</td><td>1</td><td>1</td><td>4</td><td>1</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 75.7</td><td> 52</td><td>4.93</td><td>1.615</td><td>18.52</td><td>1</td><td>1</td><td>4</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>33.9</td><td>4</td><td> 71.1</td><td> 65</td><td>4.22</td><td>1.835</td><td>19.90</td><td>1</td><td>1</td><td>4</td><td>1</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>21.5</td><td>4</td><td>120.1</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>15.5</td><td>8</td><td>318.0</td><td>150</td><td>2.76</td><td>3.520</td><td>16.87</td><td>0</td><td>0</td><td>3</td><td>2</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>304.0</td><td>150</td><td>3.15</td><td>3.435</td><td>17.30</td><td>0</td><td>0</td><td>3</td><td>2</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>13.3</td><td>8</td><td>350.0</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>19.2</td><td>8</td><td>400.0</td><td>175</td><td>3.08</td><td>3.845</td><td>17.05</td><td>0</td><td>0</td><td>3</td><td>2</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>27.3</td><td>4</td><td> 79.0</td><td> 66</td><td>4.08</td><td>1.935</td><td>18.90</td><td>1</td><td>1</td><td>4</td><td>1</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>26.0</td><td>4</td><td>120.3</td><td> 91</td><td>4.43</td><td>2.140</td><td>16.70</td><td>0</td><td>1</td><td>5</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "\t<tr><td>15.8</td><td>8</td><td>351.0</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>19.7</td><td>6</td><td>145.0</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td><td>12</td><td>24</td></tr>\n",
              "\t<tr><td>15.0</td><td>8</td><td>301.0</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td><td>16</td><td>32</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td><td> 8</td><td>16</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "0fX_sB4QM1QI",
        "outputId": "f1de5b05-6589-4dbf-c636-cb43a4a7bd48"
      },
      "source": [
        "# You can also use mutate() to remove variables and\n",
        "# modify existing variables\n",
        "#可以取代舊的欄位變成新的欄位\n",
        "mtcars.tb %>%\n",
        "  mutate(\n",
        "    mpg = NULL,\n",
        "    disp = disp * 0.0163871 # convert to litres\n",
        "  )"
      ],
      "execution_count": 12,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   cyl disp     hp  drat wt    qsec  vs am gear carb\n",
              "1  6   2.621936 110 3.90 2.620 16.46 0  1  4    4   \n",
              "2  6   2.621936 110 3.90 2.875 17.02 0  1  4    4   \n",
              "3  4   1.769807  93 3.85 2.320 18.61 1  1  4    1   \n",
              "4  6   4.227872 110 3.08 3.215 19.44 1  0  3    1   \n",
              "5  8   5.899356 175 3.15 3.440 17.02 0  0  3    2   \n",
              "6  6   3.687098 105 2.76 3.460 20.22 1  0  3    1   \n",
              "7  8   5.899356 245 3.21 3.570 15.84 0  0  3    4   \n",
              "8  4   2.403988  62 3.69 3.190 20.00 1  0  4    2   \n",
              "9  4   2.307304  95 3.92 3.150 22.90 1  0  4    2   \n",
              "10 6   2.746478 123 3.92 3.440 18.30 1  0  4    4   \n",
              "11 6   2.746478 123 3.92 3.440 18.90 1  0  4    4   \n",
              "12 8   4.519562 180 3.07 4.070 17.40 0  0  3    3   \n",
              "13 8   4.519562 180 3.07 3.730 17.60 0  0  3    3   \n",
              "14 8   4.519562 180 3.07 3.780 18.00 0  0  3    3   \n",
              "15 8   7.734711 205 2.93 5.250 17.98 0  0  3    4   \n",
              "16 8   7.538066 215 3.00 5.424 17.82 0  0  3    4   \n",
              "17 8   7.210324 230 3.23 5.345 17.42 0  0  3    4   \n",
              "18 4   1.289665  66 4.08 2.200 19.47 1  1  4    1   \n",
              "19 4   1.240503  52 4.93 1.615 18.52 1  1  4    2   \n",
              "20 4   1.165123  65 4.22 1.835 19.90 1  1  4    1   \n",
              "21 4   1.968091  97 3.70 2.465 20.01 1  0  3    1   \n",
              "22 8   5.211098 150 2.76 3.520 16.87 0  0  3    2   \n",
              "23 8   4.981678 150 3.15 3.435 17.30 0  0  3    2   \n",
              "24 8   5.735485 245 3.73 3.840 15.41 0  0  3    4   \n",
              "25 8   6.554840 175 3.08 3.845 17.05 0  0  3    2   \n",
              "26 4   1.294581  66 4.08 1.935 18.90 1  1  4    1   \n",
              "27 4   1.971368  91 4.43 2.140 16.70 0  1  5    2   \n",
              "28 4   1.558413 113 3.77 1.513 16.90 1  1  5    2   \n",
              "29 8   5.751872 264 4.22 3.170 14.50 0  1  5    4   \n",
              "30 6   2.376130 175 3.62 2.770 15.50 0  1  5    6   \n",
              "31 8   4.932517 335 3.54 3.570 14.60 0  1  5    8   \n",
              "32 4   1.982839 109 4.11 2.780 18.60 1  1  4    2   "
            ],
            "text/latex": "A tibble: 32 × 10\n\\begin{tabular}{llllllllll}\n cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 6 & 2.621936 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4\\\\\n\t 6 & 2.621936 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4\\\\\n\t 4 & 1.769807 &  93 & 3.85 & 2.320 & 18.61 & 1 & 1 & 4 & 1\\\\\n\t 6 & 4.227872 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1\\\\\n\t 8 & 5.899356 & 175 & 3.15 & 3.440 & 17.02 & 0 & 0 & 3 & 2\\\\\n\t 6 & 3.687098 & 105 & 2.76 & 3.460 & 20.22 & 1 & 0 & 3 & 1\\\\\n\t 8 & 5.899356 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4\\\\\n\t 4 & 2.403988 &  62 & 3.69 & 3.190 & 20.00 & 1 & 0 & 4 & 2\\\\\n\t 4 & 2.307304 &  95 & 3.92 & 3.150 & 22.90 & 1 & 0 & 4 & 2\\\\\n\t 6 & 2.746478 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4\\\\\n\t 6 & 2.746478 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4\\\\\n\t 8 & 4.519562 & 180 & 3.07 & 4.070 & 17.40 & 0 & 0 & 3 & 3\\\\\n\t 8 & 4.519562 & 180 & 3.07 & 3.730 & 17.60 & 0 & 0 & 3 & 3\\\\\n\t 8 & 4.519562 & 180 & 3.07 & 3.780 & 18.00 & 0 & 0 & 3 & 3\\\\\n\t 8 & 7.734711 & 205 & 2.93 & 5.250 & 17.98 & 0 & 0 & 3 & 4\\\\\n\t 8 & 7.538066 & 215 & 3.00 & 5.424 & 17.82 & 0 & 0 & 3 & 4\\\\\n\t 8 & 7.210324 & 230 & 3.23 & 5.345 & 17.42 & 0 & 0 & 3 & 4\\\\\n\t 4 & 1.289665 &  66 & 4.08 & 2.200 & 19.47 & 1 & 1 & 4 & 1\\\\\n\t 4 & 1.240503 &  52 & 4.93 & 1.615 & 18.52 & 1 & 1 & 4 & 2\\\\\n\t 4 & 1.165123 &  65 & 4.22 & 1.835 & 19.90 & 1 & 1 & 4 & 1\\\\\n\t 4 & 1.968091 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1\\\\\n\t 8 & 5.211098 & 150 & 2.76 & 3.520 & 16.87 & 0 & 0 & 3 & 2\\\\\n\t 8 & 4.981678 & 150 & 3.15 & 3.435 & 17.30 & 0 & 0 & 3 & 2\\\\\n\t 8 & 5.735485 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4\\\\\n\t 8 & 6.554840 & 175 & 3.08 & 3.845 & 17.05 & 0 & 0 & 3 & 2\\\\\n\t 4 & 1.294581 &  66 & 4.08 & 1.935 & 18.90 & 1 & 1 & 4 & 1\\\\\n\t 4 & 1.971368 &  91 & 4.43 & 2.140 & 16.70 & 0 & 1 & 5 & 2\\\\\n\t 4 & 1.558413 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 8 & 5.751872 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4\\\\\n\t 6 & 2.376130 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6\\\\\n\t 8 & 4.932517 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8\\\\\n\t 4 & 1.982839 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 10\n\n| cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|\n| 6 | 2.621936 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 |\n| 6 | 2.621936 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |\n| 4 | 1.769807 |  93 | 3.85 | 2.320 | 18.61 | 1 | 1 | 4 | 1 |\n| 6 | 4.227872 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |\n| 8 | 5.899356 | 175 | 3.15 | 3.440 | 17.02 | 0 | 0 | 3 | 2 |\n| 6 | 3.687098 | 105 | 2.76 | 3.460 | 20.22 | 1 | 0 | 3 | 1 |\n| 8 | 5.899356 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 |\n| 4 | 2.403988 |  62 | 3.69 | 3.190 | 20.00 | 1 | 0 | 4 | 2 |\n| 4 | 2.307304 |  95 | 3.92 | 3.150 | 22.90 | 1 | 0 | 4 | 2 |\n| 6 | 2.746478 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 |\n| 6 | 2.746478 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 |\n| 8 | 4.519562 | 180 | 3.07 | 4.070 | 17.40 | 0 | 0 | 3 | 3 |\n| 8 | 4.519562 | 180 | 3.07 | 3.730 | 17.60 | 0 | 0 | 3 | 3 |\n| 8 | 4.519562 | 180 | 3.07 | 3.780 | 18.00 | 0 | 0 | 3 | 3 |\n| 8 | 7.734711 | 205 | 2.93 | 5.250 | 17.98 | 0 | 0 | 3 | 4 |\n| 8 | 7.538066 | 215 | 3.00 | 5.424 | 17.82 | 0 | 0 | 3 | 4 |\n| 8 | 7.210324 | 230 | 3.23 | 5.345 | 17.42 | 0 | 0 | 3 | 4 |\n| 4 | 1.289665 |  66 | 4.08 | 2.200 | 19.47 | 1 | 1 | 4 | 1 |\n| 4 | 1.240503 |  52 | 4.93 | 1.615 | 18.52 | 1 | 1 | 4 | 2 |\n| 4 | 1.165123 |  65 | 4.22 | 1.835 | 19.90 | 1 | 1 | 4 | 1 |\n| 4 | 1.968091 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |\n| 8 | 5.211098 | 150 | 2.76 | 3.520 | 16.87 | 0 | 0 | 3 | 2 |\n| 8 | 4.981678 | 150 | 3.15 | 3.435 | 17.30 | 0 | 0 | 3 | 2 |\n| 8 | 5.735485 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 |\n| 8 | 6.554840 | 175 | 3.08 | 3.845 | 17.05 | 0 | 0 | 3 | 2 |\n| 4 | 1.294581 |  66 | 4.08 | 1.935 | 18.90 | 1 | 1 | 4 | 1 |\n| 4 | 1.971368 |  91 | 4.43 | 2.140 | 16.70 | 0 | 1 | 5 | 2 |\n| 4 | 1.558413 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 8 | 5.751872 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 |\n| 6 | 2.376130 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 |\n| 8 | 4.932517 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 |\n| 4 | 1.982839 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 10</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>6</td><td>2.621936</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>6</td><td>2.621936</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>4</td><td>1.769807</td><td> 93</td><td>3.85</td><td>2.320</td><td>18.61</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>6</td><td>4.227872</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>8</td><td>5.899356</td><td>175</td><td>3.15</td><td>3.440</td><td>17.02</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>6</td><td>3.687098</td><td>105</td><td>2.76</td><td>3.460</td><td>20.22</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>8</td><td>5.899356</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>4</td><td>2.403988</td><td> 62</td><td>3.69</td><td>3.190</td><td>20.00</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>4</td><td>2.307304</td><td> 95</td><td>3.92</td><td>3.150</td><td>22.90</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>6</td><td>2.746478</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>6</td><td>2.746478</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>8</td><td>4.519562</td><td>180</td><td>3.07</td><td>4.070</td><td>17.40</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>8</td><td>4.519562</td><td>180</td><td>3.07</td><td>3.730</td><td>17.60</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>8</td><td>4.519562</td><td>180</td><td>3.07</td><td>3.780</td><td>18.00</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>8</td><td>7.734711</td><td>205</td><td>2.93</td><td>5.250</td><td>17.98</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>8</td><td>7.538066</td><td>215</td><td>3.00</td><td>5.424</td><td>17.82</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>8</td><td>7.210324</td><td>230</td><td>3.23</td><td>5.345</td><td>17.42</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>4</td><td>1.289665</td><td> 66</td><td>4.08</td><td>2.200</td><td>19.47</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>4</td><td>1.240503</td><td> 52</td><td>4.93</td><td>1.615</td><td>18.52</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>4</td><td>1.165123</td><td> 65</td><td>4.22</td><td>1.835</td><td>19.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>4</td><td>1.968091</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>8</td><td>5.211098</td><td>150</td><td>2.76</td><td>3.520</td><td>16.87</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>8</td><td>4.981678</td><td>150</td><td>3.15</td><td>3.435</td><td>17.30</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>8</td><td>5.735485</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>8</td><td>6.554840</td><td>175</td><td>3.08</td><td>3.845</td><td>17.05</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>4</td><td>1.294581</td><td> 66</td><td>4.08</td><td>1.935</td><td>18.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>4</td><td>1.971368</td><td> 91</td><td>4.43</td><td>2.140</td><td>16.70</td><td>0</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>4</td><td>1.558413</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>8</td><td>5.751872</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td></tr>\n",
              "\t<tr><td>6</td><td>2.376130</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td></tr>\n",
              "\t<tr><td>8</td><td>4.932517</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td></tr>\n",
              "\t<tr><td>4</td><td>1.982839</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "1ChC-oS7NIvv",
        "outputId": "a97a98bf-5880-412d-babd-abee2ccef90c"
      },
      "source": [
        "# 如果你只希望保留新建立的變數，可以利用 transmute 函數。\n",
        "mtcars.tb %>%\n",
        "  transmute(displ_l = disp / 61.0237)"
      ],
      "execution_count": 13,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   displ_l \n",
              "1  2.621932\n",
              "2  2.621932\n",
              "3  1.769804\n",
              "4  4.227866\n",
              "5  5.899347\n",
              "6  3.687092\n",
              "7  5.899347\n",
              "8  2.403984\n",
              "9  2.307300\n",
              "10 2.746474\n",
              "11 2.746474\n",
              "12 4.519556\n",
              "13 4.519556\n",
              "14 4.519556\n",
              "15 7.734700\n",
              "16 7.538055\n",
              "17 7.210313\n",
              "18 1.289663\n",
              "19 1.240502\n",
              "20 1.165121\n",
              "21 1.968088\n",
              "22 5.211090\n",
              "23 4.981671\n",
              "24 5.735477\n",
              "25 6.554830\n",
              "26 1.294579\n",
              "27 1.971365\n",
              "28 1.558411\n",
              "29 5.751864\n",
              "30 2.376126\n",
              "31 4.932510\n",
              "32 1.982836"
            ],
            "text/latex": "A tibble: 32 × 1\n\\begin{tabular}{l}\n displ\\_l\\\\\n <dbl>\\\\\n\\hline\n\t 2.621932\\\\\n\t 2.621932\\\\\n\t 1.769804\\\\\n\t 4.227866\\\\\n\t 5.899347\\\\\n\t 3.687092\\\\\n\t 5.899347\\\\\n\t 2.403984\\\\\n\t 2.307300\\\\\n\t 2.746474\\\\\n\t 2.746474\\\\\n\t 4.519556\\\\\n\t 4.519556\\\\\n\t 4.519556\\\\\n\t 7.734700\\\\\n\t 7.538055\\\\\n\t 7.210313\\\\\n\t 1.289663\\\\\n\t 1.240502\\\\\n\t 1.165121\\\\\n\t 1.968088\\\\\n\t 5.211090\\\\\n\t 4.981671\\\\\n\t 5.735477\\\\\n\t 6.554830\\\\\n\t 1.294579\\\\\n\t 1.971365\\\\\n\t 1.558411\\\\\n\t 5.751864\\\\\n\t 2.376126\\\\\n\t 4.932510\\\\\n\t 1.982836\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 32 × 1\n\n| displ_l &lt;dbl&gt; |\n|---|\n| 2.621932 |\n| 2.621932 |\n| 1.769804 |\n| 4.227866 |\n| 5.899347 |\n| 3.687092 |\n| 5.899347 |\n| 2.403984 |\n| 2.307300 |\n| 2.746474 |\n| 2.746474 |\n| 4.519556 |\n| 4.519556 |\n| 4.519556 |\n| 7.734700 |\n| 7.538055 |\n| 7.210313 |\n| 1.289663 |\n| 1.240502 |\n| 1.165121 |\n| 1.968088 |\n| 5.211090 |\n| 4.981671 |\n| 5.735477 |\n| 6.554830 |\n| 1.294579 |\n| 1.971365 |\n| 1.558411 |\n| 5.751864 |\n| 2.376126 |\n| 4.932510 |\n| 1.982836 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 32 × 1</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>displ_l</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>2.621932</td></tr>\n",
              "\t<tr><td>2.621932</td></tr>\n",
              "\t<tr><td>1.769804</td></tr>\n",
              "\t<tr><td>4.227866</td></tr>\n",
              "\t<tr><td>5.899347</td></tr>\n",
              "\t<tr><td>3.687092</td></tr>\n",
              "\t<tr><td>5.899347</td></tr>\n",
              "\t<tr><td>2.403984</td></tr>\n",
              "\t<tr><td>2.307300</td></tr>\n",
              "\t<tr><td>2.746474</td></tr>\n",
              "\t<tr><td>2.746474</td></tr>\n",
              "\t<tr><td>4.519556</td></tr>\n",
              "\t<tr><td>4.519556</td></tr>\n",
              "\t<tr><td>4.519556</td></tr>\n",
              "\t<tr><td>7.734700</td></tr>\n",
              "\t<tr><td>7.538055</td></tr>\n",
              "\t<tr><td>7.210313</td></tr>\n",
              "\t<tr><td>1.289663</td></tr>\n",
              "\t<tr><td>1.240502</td></tr>\n",
              "\t<tr><td>1.165121</td></tr>\n",
              "\t<tr><td>1.968088</td></tr>\n",
              "\t<tr><td>5.211090</td></tr>\n",
              "\t<tr><td>4.981671</td></tr>\n",
              "\t<tr><td>5.735477</td></tr>\n",
              "\t<tr><td>6.554830</td></tr>\n",
              "\t<tr><td>1.294579</td></tr>\n",
              "\t<tr><td>1.971365</td></tr>\n",
              "\t<tr><td>1.558411</td></tr>\n",
              "\t<tr><td>5.751864</td></tr>\n",
              "\t<tr><td>2.376126</td></tr>\n",
              "\t<tr><td>4.932510</td></tr>\n",
              "\t<tr><td>1.982836</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "YtDkL1-dSupa",
        "outputId": "82ff16c9-bce5-4b34-e970-81dfa7b40cf7"
      },
      "source": [
        "# 根據組別加總與統整資料\n",
        "# 如果你有學過 SQL，對於 group_by 這樣的函數絕對不會陌生。\n",
        "# 假設我們想針對車子的汽缸數量做分組，可以利用以下指令：\n",
        "mtcars.tb %>%\n",
        "  group_by(cyl)"
      ],
      "execution_count": 14,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb\n",
              "1  21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4   \n",
              "2  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4   \n",
              "3  22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1   \n",
              "4  21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1   \n",
              "5  18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2   \n",
              "6  18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1   \n",
              "7  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4   \n",
              "8  24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2   \n",
              "9  22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2   \n",
              "10 19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4   \n",
              "11 17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4   \n",
              "12 16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3   \n",
              "13 17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3   \n",
              "14 15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3   \n",
              "15 10.4 8   472.0 205 2.93 5.250 17.98 0  0  3    4   \n",
              "16 10.4 8   460.0 215 3.00 5.424 17.82 0  0  3    4   \n",
              "17 14.7 8   440.0 230 3.23 5.345 17.42 0  0  3    4   \n",
              "18 32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1   \n",
              "19 30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2   \n",
              "20 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1   \n",
              "21 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1   \n",
              "22 15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2   \n",
              "23 15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2   \n",
              "24 13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4   \n",
              "25 19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2   \n",
              "26 27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1   \n",
              "27 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2   \n",
              "28 30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2   \n",
              "29 15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4   \n",
              "30 19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6   \n",
              "31 15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8   \n",
              "32 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2   "
            ],
            "text/latex": "A grouped\\_df: 32 × 11\n\\begin{tabular}{lllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.620 & 16.46 & 0 & 1 & 4 & 4\\\\\n\t 21.0 & 6 & 160.0 & 110 & 3.90 & 2.875 & 17.02 & 0 & 1 & 4 & 4\\\\\n\t 22.8 & 4 & 108.0 &  93 & 3.85 & 2.320 & 18.61 & 1 & 1 & 4 & 1\\\\\n\t 21.4 & 6 & 258.0 & 110 & 3.08 & 3.215 & 19.44 & 1 & 0 & 3 & 1\\\\\n\t 18.7 & 8 & 360.0 & 175 & 3.15 & 3.440 & 17.02 & 0 & 0 & 3 & 2\\\\\n\t 18.1 & 6 & 225.0 & 105 & 2.76 & 3.460 & 20.22 & 1 & 0 & 3 & 1\\\\\n\t 14.3 & 8 & 360.0 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4\\\\\n\t 24.4 & 4 & 146.7 &  62 & 3.69 & 3.190 & 20.00 & 1 & 0 & 4 & 2\\\\\n\t 22.8 & 4 & 140.8 &  95 & 3.92 & 3.150 & 22.90 & 1 & 0 & 4 & 2\\\\\n\t 19.2 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4\\\\\n\t 17.8 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4\\\\\n\t 16.4 & 8 & 275.8 & 180 & 3.07 & 4.070 & 17.40 & 0 & 0 & 3 & 3\\\\\n\t 17.3 & 8 & 275.8 & 180 & 3.07 & 3.730 & 17.60 & 0 & 0 & 3 & 3\\\\\n\t 15.2 & 8 & 275.8 & 180 & 3.07 & 3.780 & 18.00 & 0 & 0 & 3 & 3\\\\\n\t 10.4 & 8 & 472.0 & 205 & 2.93 & 5.250 & 17.98 & 0 & 0 & 3 & 4\\\\\n\t 10.4 & 8 & 460.0 & 215 & 3.00 & 5.424 & 17.82 & 0 & 0 & 3 & 4\\\\\n\t 14.7 & 8 & 440.0 & 230 & 3.23 & 5.345 & 17.42 & 0 & 0 & 3 & 4\\\\\n\t 32.4 & 4 &  78.7 &  66 & 4.08 & 2.200 & 19.47 & 1 & 1 & 4 & 1\\\\\n\t 30.4 & 4 &  75.7 &  52 & 4.93 & 1.615 & 18.52 & 1 & 1 & 4 & 2\\\\\n\t 33.9 & 4 &  71.1 &  65 & 4.22 & 1.835 & 19.90 & 1 & 1 & 4 & 1\\\\\n\t 21.5 & 4 & 120.1 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1\\\\\n\t 15.5 & 8 & 318.0 & 150 & 2.76 & 3.520 & 16.87 & 0 & 0 & 3 & 2\\\\\n\t 15.2 & 8 & 304.0 & 150 & 3.15 & 3.435 & 17.30 & 0 & 0 & 3 & 2\\\\\n\t 13.3 & 8 & 350.0 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4\\\\\n\t 19.2 & 8 & 400.0 & 175 & 3.08 & 3.845 & 17.05 & 0 & 0 & 3 & 2\\\\\n\t 27.3 & 4 &  79.0 &  66 & 4.08 & 1.935 & 18.90 & 1 & 1 & 4 & 1\\\\\n\t 26.0 & 4 & 120.3 &  91 & 4.43 & 2.140 & 16.70 & 0 & 1 & 5 & 2\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 15.8 & 8 & 351.0 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4\\\\\n\t 19.7 & 6 & 145.0 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6\\\\\n\t 15.0 & 8 & 301.0 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA grouped_df: 32 × 11\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.620 | 16.46 | 0 | 1 | 4 | 4 |\n| 21.0 | 6 | 160.0 | 110 | 3.90 | 2.875 | 17.02 | 0 | 1 | 4 | 4 |\n| 22.8 | 4 | 108.0 |  93 | 3.85 | 2.320 | 18.61 | 1 | 1 | 4 | 1 |\n| 21.4 | 6 | 258.0 | 110 | 3.08 | 3.215 | 19.44 | 1 | 0 | 3 | 1 |\n| 18.7 | 8 | 360.0 | 175 | 3.15 | 3.440 | 17.02 | 0 | 0 | 3 | 2 |\n| 18.1 | 6 | 225.0 | 105 | 2.76 | 3.460 | 20.22 | 1 | 0 | 3 | 1 |\n| 14.3 | 8 | 360.0 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 |\n| 24.4 | 4 | 146.7 |  62 | 3.69 | 3.190 | 20.00 | 1 | 0 | 4 | 2 |\n| 22.8 | 4 | 140.8 |  95 | 3.92 | 3.150 | 22.90 | 1 | 0 | 4 | 2 |\n| 19.2 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 |\n| 17.8 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 |\n| 16.4 | 8 | 275.8 | 180 | 3.07 | 4.070 | 17.40 | 0 | 0 | 3 | 3 |\n| 17.3 | 8 | 275.8 | 180 | 3.07 | 3.730 | 17.60 | 0 | 0 | 3 | 3 |\n| 15.2 | 8 | 275.8 | 180 | 3.07 | 3.780 | 18.00 | 0 | 0 | 3 | 3 |\n| 10.4 | 8 | 472.0 | 205 | 2.93 | 5.250 | 17.98 | 0 | 0 | 3 | 4 |\n| 10.4 | 8 | 460.0 | 215 | 3.00 | 5.424 | 17.82 | 0 | 0 | 3 | 4 |\n| 14.7 | 8 | 440.0 | 230 | 3.23 | 5.345 | 17.42 | 0 | 0 | 3 | 4 |\n| 32.4 | 4 |  78.7 |  66 | 4.08 | 2.200 | 19.47 | 1 | 1 | 4 | 1 |\n| 30.4 | 4 |  75.7 |  52 | 4.93 | 1.615 | 18.52 | 1 | 1 | 4 | 2 |\n| 33.9 | 4 |  71.1 |  65 | 4.22 | 1.835 | 19.90 | 1 | 1 | 4 | 1 |\n| 21.5 | 4 | 120.1 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |\n| 15.5 | 8 | 318.0 | 150 | 2.76 | 3.520 | 16.87 | 0 | 0 | 3 | 2 |\n| 15.2 | 8 | 304.0 | 150 | 3.15 | 3.435 | 17.30 | 0 | 0 | 3 | 2 |\n| 13.3 | 8 | 350.0 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 |\n| 19.2 | 8 | 400.0 | 175 | 3.08 | 3.845 | 17.05 | 0 | 0 | 3 | 2 |\n| 27.3 | 4 |  79.0 |  66 | 4.08 | 1.935 | 18.90 | 1 | 1 | 4 | 1 |\n| 26.0 | 4 | 120.3 |  91 | 4.43 | 2.140 | 16.70 | 0 | 1 | 5 | 2 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 15.8 | 8 | 351.0 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 |\n| 19.7 | 6 | 145.0 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 |\n| 15.0 | 8 | 301.0 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A grouped_df: 32 × 11</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.620</td><td>16.46</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>21.0</td><td>6</td><td>160.0</td><td>110</td><td>3.90</td><td>2.875</td><td>17.02</td><td>0</td><td>1</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>108.0</td><td> 93</td><td>3.85</td><td>2.320</td><td>18.61</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>21.4</td><td>6</td><td>258.0</td><td>110</td><td>3.08</td><td>3.215</td><td>19.44</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>18.7</td><td>8</td><td>360.0</td><td>175</td><td>3.15</td><td>3.440</td><td>17.02</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>18.1</td><td>6</td><td>225.0</td><td>105</td><td>2.76</td><td>3.460</td><td>20.22</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>14.3</td><td>8</td><td>360.0</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>24.4</td><td>4</td><td>146.7</td><td> 62</td><td>3.69</td><td>3.190</td><td>20.00</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>22.8</td><td>4</td><td>140.8</td><td> 95</td><td>3.92</td><td>3.150</td><td>22.90</td><td>1</td><td>0</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>19.2</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>17.8</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>16.4</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>4.070</td><td>17.40</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>17.3</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.730</td><td>17.60</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>275.8</td><td>180</td><td>3.07</td><td>3.780</td><td>18.00</td><td>0</td><td>0</td><td>3</td><td>3</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>472.0</td><td>205</td><td>2.93</td><td>5.250</td><td>17.98</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>10.4</td><td>8</td><td>460.0</td><td>215</td><td>3.00</td><td>5.424</td><td>17.82</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>14.7</td><td>8</td><td>440.0</td><td>230</td><td>3.23</td><td>5.345</td><td>17.42</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>32.4</td><td>4</td><td> 78.7</td><td> 66</td><td>4.08</td><td>2.200</td><td>19.47</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 75.7</td><td> 52</td><td>4.93</td><td>1.615</td><td>18.52</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>33.9</td><td>4</td><td> 71.1</td><td> 65</td><td>4.22</td><td>1.835</td><td>19.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>21.5</td><td>4</td><td>120.1</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "\t<tr><td>15.5</td><td>8</td><td>318.0</td><td>150</td><td>2.76</td><td>3.520</td><td>16.87</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>15.2</td><td>8</td><td>304.0</td><td>150</td><td>3.15</td><td>3.435</td><td>17.30</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>13.3</td><td>8</td><td>350.0</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>19.2</td><td>8</td><td>400.0</td><td>175</td><td>3.08</td><td>3.845</td><td>17.05</td><td>0</td><td>0</td><td>3</td><td>2</td></tr>\n",
              "\t<tr><td>27.3</td><td>4</td><td> 79.0</td><td> 66</td><td>4.08</td><td>1.935</td><td>18.90</td><td>1</td><td>1</td><td>4</td><td>1</td></tr>\n",
              "\t<tr><td>26.0</td><td>4</td><td>120.3</td><td> 91</td><td>4.43</td><td>2.140</td><td>16.70</td><td>0</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>15.8</td><td>8</td><td>351.0</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td></tr>\n",
              "\t<tr><td>19.7</td><td>6</td><td>145.0</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td></tr>\n",
              "\t<tr><td>15.0</td><td>8</td><td>301.0</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 331
        },
        "id": "beHgwK8LTLlY",
        "outputId": "b0aaf16d-4fca-413a-ae93-df442d8fc4ce"
      },
      "source": [
        "# 看起來好像沒發生什麼特別的事情，但如果我們利用 R 的 debug 函數 brower() 去看看 group_by 的執行狀況，就知道發生了什麼事情了！\n",
        "# 可以在 R Studio 的 console 區執行以下程式碼。\n",
        "mtcars.tb %>%\n",
        "  group_by(cyl) %>%\n",
        "  do(browser())"
      ],
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Called from: eval_tidy(args[[j]], mask)\n",
            "Called from: eval_tidy(args[[j]], mask)\n",
            "Called from: eval_tidy(args[[j]], mask)\n"
          ],
          "name": "stdout"
        },
        {
          "output_type": "error",
          "ename": "ERROR",
          "evalue": "ignored",
          "traceback": [
            "Error: Results 1, 2, 3 must be data frames, not NULL\nTraceback:\n",
            "1. mtcars.tb %>% group_by(cyl) %>% do(browser())",
            "2. do(., browser())",
            "3. do.grouped_df(., browser())",
            "4. label_output_dataframe(labels, out, group_vars(.data), group_by_drop_default(.data))",
            "5. bad(\"Results {bad} must be data frames, not {first_bad_class}\", \n .     bad = fmt_comma(which(!data_frame)), first_bad_class = fmt_classes(out[[1]][[which.min(data_frame)]]))",
            "6. glubort(NULL, ..., .envir = parent.frame())",
            "7. .abort(text)",
            "8. signal_abort(cnd)"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 185
        },
        "id": "L9VpZmkFTu_3",
        "outputId": "3e75091a-1101-45fc-8d33-bbfdc642e645"
      },
      "source": [
        "# 如果我們想要看分組後的資料總結，可以使用 summarise 函數：\n",
        "mtcars.tb %>%\n",
        "  group_by(cyl) %>%\n",
        "  summarise(\n",
        "    number = n(),\n",
        "    avg_hp = mean(hp),\n",
        "    sd_hp = sd(hp),\n",
        "    max_hp = max(hp),\n",
        "    min_hp = min(hp)\n",
        "  ) %>%\n",
        "  arrange(desc(avg_hp))"
      ],
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "  cyl number avg_hp    sd_hp    max_hp min_hp\n",
              "1 8   14     209.21429 50.97689 335    150   \n",
              "2 6    7     122.28571 24.26049 175    105   \n",
              "3 4   11      82.63636 20.93453 113     52   "
            ],
            "text/latex": "A tibble: 3 × 6\n\\begin{tabular}{llllll}\n cyl & number & avg\\_hp & sd\\_hp & max\\_hp & min\\_hp\\\\\n <dbl> & <int> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 8 & 14 & 209.21429 & 50.97689 & 335 & 150\\\\\n\t 6 &  7 & 122.28571 & 24.26049 & 175 & 105\\\\\n\t 4 & 11 &  82.63636 & 20.93453 & 113 &  52\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA tibble: 3 × 6\n\n| cyl &lt;dbl&gt; | number &lt;int&gt; | avg_hp &lt;dbl&gt; | sd_hp &lt;dbl&gt; | max_hp &lt;dbl&gt; | min_hp &lt;dbl&gt; |\n|---|---|---|---|---|---|\n| 8 | 14 | 209.21429 | 50.97689 | 335 | 150 |\n| 6 |  7 | 122.28571 | 24.26049 | 175 | 105 |\n| 4 | 11 |  82.63636 | 20.93453 | 113 |  52 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A tibble: 3 × 6</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>cyl</th><th scope=col>number</th><th scope=col>avg_hp</th><th scope=col>sd_hp</th><th scope=col>max_hp</th><th scope=col>min_hp</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;int&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>8</td><td>14</td><td>209.21429</td><td>50.97689</td><td>335</td><td>150</td></tr>\n",
              "\t<tr><td>6</td><td> 7</td><td>122.28571</td><td>24.26049</td><td>175</td><td>105</td></tr>\n",
              "\t<tr><td>4</td><td>11</td><td> 82.63636</td><td>20.93453</td><td>113</td><td> 52</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 395
        },
        "id": "paVqTS8wT5Q1",
        "outputId": "072dac02-a333-492f-ab92-785e45cebf54"
      },
      "source": [
        "# group_by 也可以用來分組篩選資料，比如說找出每組最大馬力的三輛車資料。\n",
        "mtcars.tb %>%\n",
        "  group_by(cyl) %>%\n",
        "  filter(rank(desc(hp)) < 4) %>%\n",
        "  arrange(desc(cyl), desc(hp))"
      ],
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb\n",
              "1  15.0 8   301.0 335 3.54 3.570 14.60 0  1  5    8   \n",
              "2  15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4   \n",
              "3  14.3 8   360.0 245 3.21 3.570 15.84 0  0  3    4   \n",
              "4  13.3 8   350.0 245 3.73 3.840 15.41 0  0  3    4   \n",
              "5  19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6   \n",
              "6  19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4   \n",
              "7  17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4   \n",
              "8  30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2   \n",
              "9  21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2   \n",
              "10 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1   "
            ],
            "text/latex": "A grouped\\_df: 10 × 11\n\\begin{tabular}{lllllllllll}\n mpg & cyl & disp & hp & drat & wt & qsec & vs & am & gear & carb\\\\\n <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl> & <dbl>\\\\\n\\hline\n\t 15.0 & 8 & 301.0 & 335 & 3.54 & 3.570 & 14.60 & 0 & 1 & 5 & 8\\\\\n\t 15.8 & 8 & 351.0 & 264 & 4.22 & 3.170 & 14.50 & 0 & 1 & 5 & 4\\\\\n\t 14.3 & 8 & 360.0 & 245 & 3.21 & 3.570 & 15.84 & 0 & 0 & 3 & 4\\\\\n\t 13.3 & 8 & 350.0 & 245 & 3.73 & 3.840 & 15.41 & 0 & 0 & 3 & 4\\\\\n\t 19.7 & 6 & 145.0 & 175 & 3.62 & 2.770 & 15.50 & 0 & 1 & 5 & 6\\\\\n\t 19.2 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.30 & 1 & 0 & 4 & 4\\\\\n\t 17.8 & 6 & 167.6 & 123 & 3.92 & 3.440 & 18.90 & 1 & 0 & 4 & 4\\\\\n\t 30.4 & 4 &  95.1 & 113 & 3.77 & 1.513 & 16.90 & 1 & 1 & 5 & 2\\\\\n\t 21.4 & 4 & 121.0 & 109 & 4.11 & 2.780 & 18.60 & 1 & 1 & 4 & 2\\\\\n\t 21.5 & 4 & 120.1 &  97 & 3.70 & 2.465 & 20.01 & 1 & 0 & 3 & 1\\\\\n\\end{tabular}\n",
            "text/markdown": "\nA grouped_df: 10 × 11\n\n| mpg &lt;dbl&gt; | cyl &lt;dbl&gt; | disp &lt;dbl&gt; | hp &lt;dbl&gt; | drat &lt;dbl&gt; | wt &lt;dbl&gt; | qsec &lt;dbl&gt; | vs &lt;dbl&gt; | am &lt;dbl&gt; | gear &lt;dbl&gt; | carb &lt;dbl&gt; |\n|---|---|---|---|---|---|---|---|---|---|---|\n| 15.0 | 8 | 301.0 | 335 | 3.54 | 3.570 | 14.60 | 0 | 1 | 5 | 8 |\n| 15.8 | 8 | 351.0 | 264 | 4.22 | 3.170 | 14.50 | 0 | 1 | 5 | 4 |\n| 14.3 | 8 | 360.0 | 245 | 3.21 | 3.570 | 15.84 | 0 | 0 | 3 | 4 |\n| 13.3 | 8 | 350.0 | 245 | 3.73 | 3.840 | 15.41 | 0 | 0 | 3 | 4 |\n| 19.7 | 6 | 145.0 | 175 | 3.62 | 2.770 | 15.50 | 0 | 1 | 5 | 6 |\n| 19.2 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.30 | 1 | 0 | 4 | 4 |\n| 17.8 | 6 | 167.6 | 123 | 3.92 | 3.440 | 18.90 | 1 | 0 | 4 | 4 |\n| 30.4 | 4 |  95.1 | 113 | 3.77 | 1.513 | 16.90 | 1 | 1 | 5 | 2 |\n| 21.4 | 4 | 121.0 | 109 | 4.11 | 2.780 | 18.60 | 1 | 1 | 4 | 2 |\n| 21.5 | 4 | 120.1 |  97 | 3.70 | 2.465 | 20.01 | 1 | 0 | 3 | 1 |\n\n",
            "text/html": [
              "<table class=\"dataframe\">\n",
              "<caption>A grouped_df: 10 × 11</caption>\n",
              "<thead>\n",
              "\t<tr><th scope=col>mpg</th><th scope=col>cyl</th><th scope=col>disp</th><th scope=col>hp</th><th scope=col>drat</th><th scope=col>wt</th><th scope=col>qsec</th><th scope=col>vs</th><th scope=col>am</th><th scope=col>gear</th><th scope=col>carb</th></tr>\n",
              "\t<tr><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th><th scope=col>&lt;dbl&gt;</th></tr>\n",
              "</thead>\n",
              "<tbody>\n",
              "\t<tr><td>15.0</td><td>8</td><td>301.0</td><td>335</td><td>3.54</td><td>3.570</td><td>14.60</td><td>0</td><td>1</td><td>5</td><td>8</td></tr>\n",
              "\t<tr><td>15.8</td><td>8</td><td>351.0</td><td>264</td><td>4.22</td><td>3.170</td><td>14.50</td><td>0</td><td>1</td><td>5</td><td>4</td></tr>\n",
              "\t<tr><td>14.3</td><td>8</td><td>360.0</td><td>245</td><td>3.21</td><td>3.570</td><td>15.84</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>13.3</td><td>8</td><td>350.0</td><td>245</td><td>3.73</td><td>3.840</td><td>15.41</td><td>0</td><td>0</td><td>3</td><td>4</td></tr>\n",
              "\t<tr><td>19.7</td><td>6</td><td>145.0</td><td>175</td><td>3.62</td><td>2.770</td><td>15.50</td><td>0</td><td>1</td><td>5</td><td>6</td></tr>\n",
              "\t<tr><td>19.2</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.30</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>17.8</td><td>6</td><td>167.6</td><td>123</td><td>3.92</td><td>3.440</td><td>18.90</td><td>1</td><td>0</td><td>4</td><td>4</td></tr>\n",
              "\t<tr><td>30.4</td><td>4</td><td> 95.1</td><td>113</td><td>3.77</td><td>1.513</td><td>16.90</td><td>1</td><td>1</td><td>5</td><td>2</td></tr>\n",
              "\t<tr><td>21.4</td><td>4</td><td>121.0</td><td>109</td><td>4.11</td><td>2.780</td><td>18.60</td><td>1</td><td>1</td><td>4</td><td>2</td></tr>\n",
              "\t<tr><td>21.5</td><td>4</td><td>120.1</td><td> 97</td><td>3.70</td><td>2.465</td><td>20.01</td><td>1</td><td>0</td><td>3</td><td>1</td></tr>\n",
              "</tbody>\n",
              "</table>\n"
            ]
          },
          "metadata": {
            "tags": []
          }
        }
      ]
    }
  ]
}